wegam/STM32F1xWorkSpace/Examples/HC/PC006V21 - 20180130.C
	TIM_ConfigurationFreq(MOTOR_TIMxUD,MOTOR_PWM_FrequencyUD);		//定时器频率配置方式，最小频率0.01Hz,最大100KHz //由于翻转需要双倍频率
	
	//2）============================传感器接口配置:配置为上拉输入模式(低有效）
	//-----Sensor1-PB4	前传感器
	//-----Sensor2-PB5	后传感器
	//-----Sensor3-PB6	药品传感器
	//-----Sensor4-PB7	备用传感器
	GPIO_Configuration_IPU(Sensor1_Port,	Sensor1_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor2_Port,	Sensor2_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor3_Port,	Sensor3_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor4_Port,	Sensor4_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605

	//======脉冲输出：PA7电机控制板CCW做脉冲输出
	GPIO_Configuration_OPP50	(MOTOR_Plus_PORT,		MOTOR_Plus_Pin);			//CCW	//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	//======方向控制输出：PA6电机控制板CW做方向输出
	GPIO_Configuration_OPP50	(MOTOR_DIR_PORT,		MOTOR_DIR_Pin);			//CW	//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	//3）============================CAN配置：500K
	CAN_Configuration_NR(CAN1_BaudRate);			//CAN1配置---标志位查询方式，不开中断--速率500K
	//4）============================CAN配置滤波器配置(使用两组滤波器分别与传感器板通讯和接收外部控制指令通讯）
	//-----传感器信号读取滤波器（与旋转传感器板通讯）：MotorBD_Group，MotorBD_ID
	CAN_FilterInitConfiguration_StdData(MotorUD_Group,MotorUD_ID,	(MotorUD_ID)^0XFFFF);			//CAN滤波器配置---标准数据帧模式---BIT7不过滤
	//-----旋转命令滤波器：Cmd_Group，Cmd_ID
	CAN_FilterInitConfiguration_StdData(Cmd_Group,		Cmd_ID,			0xFFFF);			//CAN滤波器配置---标准数据帧模式---电机控制板接收外部控制命令接口

	//4）============================系统嘀嗒时钟配置：做定时程序扫描
	SysTick_Configuration(100);		//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
}
/*******************************************************************************
*函数名			:	MotorBoard_Configuration
*功能描述		:	旋转电机控制板配置
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void MotorRLBoard_Configuration(void)		//旋转电机控制板配置
{
	//============================GPIO配置
	//电机控制板：	PA6-脉冲输出，PA7-方向控制输出
	//传感器板：		PA6，PA7做传感器指示灯（采集信号时闪烁）
	//1）============================步进电机参数配置	
//	TIM_ConfigurationFreq(MOTOR_TIMxRL,MOTOR_PWM_FrequencyRL);		//定时器频率配置方式，最小频率0.01Hz,最大100KHz //由于翻转需要双倍频率
	Motor_Configuration();
	//======脉冲输出：PA7电机控制板CCW做脉冲输出
	GPIO_Configuration_OPP50	(MOTOR_Plus_PORT,		MOTOR_Plus_Pin);			//CCW	//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	//======方向控制输出：PA6电机控制板CW做方向输出
	GPIO_Configuration_OPP50	(MOTOR_DIR_PORT,		MOTOR_DIR_Pin);			//CW	//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	//3）============================CAN配置：500K
	CAN_Configuration_NR(CAN1_BaudRate);			//CAN1配置---标志位查询方式，不开中断--速率500K
	//4）============================CAN配置滤波器配置(使用两组滤波器分别与传感器板通讯和接收外部控制指令通讯）
	//-----传感器信号读取滤波器（与旋转传感器板通讯）：MotorBD_Group，MotorBD_ID
	CAN_FilterInitConfiguration_StdData(MotorRL_Group,MotorRL_ID,	(MotorRL_ID^SensorRL_ID)^0XFFFF);			//CAN滤波器配置---标准数据帧模式---BIT7不过滤
	//-----旋转命令滤波器：Cmd_Group，Cmd_ID
	CAN_FilterInitConfiguration_StdData(Cmd_Group,		Cmd_ID,			0xFFFF);			//CAN滤波器配置---标准数据帧模式---电机控制板接收外部控制命令接口

	//4）============================系统嘀嗒时钟配置：做定时程序扫描
	SysTick_Configuration(1000);		//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
}
/*******************************************************************************
*函数名			:	SensorBoard_Configuration
*功能描述		:	旋转控制传感器板配置
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void SensorRLBoard_Configuration(void)		//旋转控制传感器板配置
{
	//============================PA6-CCW,PA7-CW配置
	//电机控制板：	PA6-脉冲输出，PA7-方向控制输出
	//传感器板：		PA6，PA7做传感器指示灯（采集信号时闪烁）
	
	//1）============================信号采样闪烁LED配置
	GPIO_Configuration_OPP2	(TXLED_PORT,TXLED_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP2	(RXLED_PORT,RXLED_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	//2）============================传感器接口配置:配置为上拉输入模式(低有效）
	//-----Sensor1-PB4	前传感器
	//-----Sensor2-PB5	后传感器
	//-----Sensor3-PB6	药品传感器
	//-----Sensor4-PB7	备用传感器
	GPIO_Configuration_IPU(Sensor1_Port,	Sensor1_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor2_Port,	Sensor2_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor3_Port,	Sensor3_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor4_Port,	Sensor4_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605		

	//3）============================CAN配置：500K
	//--------接收电机控制板命令：开启读传感器信号或者关闭
	CAN_Configuration_NR(CAN1_BaudRate);			//CAN1配置---标志位查询方式，不开中断--速率500K
	//4）============================CAN配置滤波器配置
	//-----传感器信号读取滤波器（与旋转电机控制板通讯）：SensorBD_Group，SensorBD_ID
	CAN_FilterInitConfiguration_StdData(SensorRL_Group,SensorRL_ID,(MotorRL_ID^SensorRL_ID)^0XFFFF);			//CAN滤波器配置---标准数据帧模式---BIT7不过滤
	//5）============================系统嘀嗒时钟配置：做定时程序扫描
	SysTick_Configuration(500);			//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server(0.1ms扫描传感器)
}
//==============================================================================


/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void MotorUDBoard_Server(void)		//电机控制板服务程序
{
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	//先后顺序要求：电机运行时需要接收传感器板的数据，所以需要先查询CAN数据
//	u8 status	=	0;			//CAN读取返回0表示无效
	
	//1）============================独立看门狗喂狗
	IWDG_Feed();				//独立看门狗喂狗

	//2）============================查询CAN发送数据
	CAN_Server();					//CAN收发数据管理
	
	//3）============================查询电机控制程序：电机控制采用定时器中断
	MotorUD_Server();				//查询步进电机状态---电机的运行、停止、当前状态查询	
	
	//5）============================清除数据
	RxMessage.StdId	=	0x00;
	memset(RxMessage.Data,0X00,8);
	
	//6）============================计时器1ms
	SYSTime++;
	if(SYSTime>=4000)
	{		
		SYSTime=0;
	}
	
	//4）============================测试模式
	Test_modle();					//测试模式
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void MotorRLBoard_Server(void)		//电机控制板服务程序
{
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	//先后顺序要求：电机运行时需要接收传感器板的数据，所以需要先查询CAN数据
//	u8 status	=	0;			//CAN读取返回0表示无效
	//1）============================电机
	
	//1）============================独立看门狗喂狗
	IWDG_Feed();				//独立看门狗喂狗

	//2）============================查询CAN发送数据
	CAN_Server();					//CAN收发数据管理
	
	//3）============================查询电机控制程序：电机控制采用定时器中断
	MotorRL_Server();				//查询步进电机状态---电机的运行、停止、当前状态查询
	
	
	
	//5）============================清除数据
	RxMessage.StdId	=	0x00;
	memset(RxMessage.Data,0X00,8);
	
	//6）============================计时器1ms
	SYSTime++;
	if(SYSTime>=4000)
	{		
		SYSTime=0;
	}
	
	
//	if(StatusOfWindow	==0)	//未初始化，不执行测试模式
//	{
//		return;
//	}
	//4）============================测试模式	
	Test_modle();					//测试模式
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void SensorRLBoard_Server(void)		//传感器板服务程序
{
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	u8 status	=	0;			//CAN读取返回0表示无效
	//1）============================独立看门狗喂狗
	IWDG_Feed();				//独立看门狗喂狗
	//2）============================查询CAN接收数据
	CAN_Server();			//CAN收发数据管理
	//******************************************************************************
	//								以下部分根据旋转控制板的命令选择是否执行
	//******************************************************************************
	if(SensorON	==0)			//传感器板未收到工作命令
	{
		SYSTime	=	0;
		TXLED_PORT->BRR=TXLED_Pin;		//PA6传感器板CCW做脉冲输出---LED_OFF
		RXLED_PORT->BRR=RXLED_Pin;		//PA7传感器板CW做方向输出---LED_OFF
		return;
	}
	//3）============================计时器0.1ms
	SYSTime++;
	if(SYSTime>=100000)
	{		
		SYSTime=0;
	}
	//4）============================读取各传感器
	if((Sensor1_Status==0)	&&	(Sensor[0]<0xFF))
	{
		Sensor[0]++;
	}
	else
	{
		Sensor[0]	=	0;
	}
	if((Sensor2_Status==0)	&&	(Sensor[1]<0xFF))
	{
		Sensor[1]++;
	}
	else
	{
		Sensor[1]	=	0;
	}
	if((Sensor3_Status==0)	&&	(Sensor[2]<0xFF))
	{
		Sensor[2]++;
	}
	else
	{
		Sensor[2]	=	0;
	}
	if((Sensor4_Status==0)	&&	(Sensor[3]<0xFF))
	{
		Sensor[3]++;
	}
	else
	{
		Sensor[3]	=	0;
	}
	//5）============================上报传感器数据：0.5ms上服一次数据
//	if(SYSTime%5==0)									//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
//	{
//		CAN_StdTX_DATA(SensorRL_ID,4,Sensor);			//CAN使用标准帧发送数据---发送传感器数据 0.5ms发送间隔
//	}
	//6）============================传感器板在工作时LED闪烁
	if(SYSTime%100==0)
	{
		TXLED_PORT->BSRR=TXLED_Pin;		//PA6传感器板CCW做脉冲输出---LED_ON
		RXLED_PORT->BSRR=RXLED_Pin;		//PA7传感器板CW做方向输出---LED_ON
	}
	else	if(SYSTime%100==20)
	{
		TXLED_PORT->BRR=TXLED_Pin;		//PA6传感器板CCW做脉冲输出---LED_OFF
		RXLED_PORT->BRR=RXLED_Pin;		//PA7传感器板CW做方向输出---LED_OFF
	}
}


//==============================================================================




