wegam/STM32F1xWorkSpace/Examples/HC/PC006V21 - 20180130.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:		
*******************************************************************************/
void Motor_Configuration(void)
{
	SteepMotor1.SetTIMx			=	MOTOR_TIMx;
	
	SteepMotor1.SetPulsPort	=	MOTOR_Plus_PORT;
	SteepMotor1.SetPulsPin	=	MOTOR_Plus_Pin;
	
	SteepMotor1.SetDIRPort	=	MOTOR_DIR_PORT;
	SteepMotor1.SetDIRPin		=	MOTOR_DIR_Pin;
	
	SteepMotor1.SetFrequency	=	1000;
	
	StepMotorConfiguration(&SteepMotor1);		//
}









/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Test_modle(void)		//测试模式
{
#ifdef	TestModel
	
	
	
	if(StatusOfWindow	==	0)		//未初始化，不执行测试模式
	{
		CCWFlag	=	0;	//运行方向标志
		return;
	}
	

	if(RunToWindow!=0)
	{
//		TestTime	=	0;
		return;
	}
	else
	{
		TestTime++;
		if(TestTime>=2000)
		{
			TestTime	=	0;
		}
	
		if(MotorRL)
		{
			CMDOfWindow	=	(TestTime%MaxWindowRL)+1;
		}
		else if(MotorUD)
		{
			CMDOfWindow	=	(TestTime%MaxWindowUD)+1;
		}

	}
	
	
	
	
//	if(StatusOfWindow	==	0)
//	{
//		CCWFlag	=	0;	//运行方向标志
//		return;
//	}
//	
//	if(RunToWindow!=0)
//	{
//		TestTime	=	0;
//	}
//	else
//	{
//		TestTime++;
//	}
////	if(RunToWindow!=0)
////	{
////		return;
////	}
//	if(TestTime	>=	500)
//	{
//		TestTime	=	0;
//		if(CCWFlag	==	0)		//正转
//		{
//			CMDOfWindow	=	StatusOfWindow+1;
//			if(CMDOfWindow	>=	MaxWindow)
//			{
//				CCWFlag	=	1;
//			}
//		}
//		else		//反转
//		{
//			CMDOfWindow	=	StatusOfWindow-1;
//			if(CMDOfWindow	<=	1)
//			{
//				CCWFlag	=	0;
//			}
//		}
//	}
#endif
}
//==============================================================================








///*******************************************************************************
//*函数名			:	function
//*功能描述		:	函数功能说明
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	
//*******************************************************************************/
//void Motor_RunSet(int Num)			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//{
//	if(Num	==	0)		//强制停止
//	{
////		MOTOR_DISABLE;								//停止电机
//		PWM_OUT_SetCount(&PWM_Tim,0);		//设置输出个数
//	}
//	else if(Num>0)
//	{
////		Motor_Configuration();			//步进电机驱动配置
//		PWM_Tim.PWM_BasicData.PWM_Frequency=MOTOR_PWM_Frequency;						//频率增加--加速
//		PWM_OUT_SetFre(&PWM_Tim,10);
//		MOTOR_RunRight;													//顺时钟
//		PWM_OUT_SetCount(&PWM_Tim,Num);		//设置总输出脉冲个数
//	}
//	else
//	{
////		Motor_Configuration();			//步进电机驱动配置
//		PWM_Tim.PWM_BasicData.PWM_Frequency=MOTOR_PWM_Frequency;						//频率增加--加速
//		PWM_OUT_SetFre(&PWM_Tim,10);
//		Num	=	0	-	Num;
//		MOTOR_RunLeft;													//逆时钟
//		PWM_OUT_SetCount(&PWM_Tim,Num);		//设置总输出脉冲个数
//	}	
//}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	0-无定时器中断，1-有定时器中断
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
u8 MotorUD_Server(void)				//查询步进电机状态
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 StatusOfWindow	=	0;	//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	
	//==============电机控制说明
	//运行过程分：启动加速，匀速运行，减速停止
	//窗口位置：
	//电机原点为中间传感器：上电时，先逆时针慢速运转到极限位再回到原点（如果在回极限位过程中找到原点，则停止在原点，初始化完成）
	
//	u8 status	=	0;
	
	
	if((MOTOR_TIMxUD->SR & TIM_IT_Update)==TIM_IT_Update	&&	RunToWindow!=0)			//表示定时中断---运行计数未完
	{
		if(PlusFlg	!=0)			//步进电机脉冲标志，一个上升沿计一个脉冲
		{
			PlusFlg	=	0;				//步进电机脉冲标志，一个上升沿计一个脉冲
			SteepCount	+=	1;							//运行步数计数
			if(Sensor1_Status==0)
			{
				StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
				RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				
				MOTOR_PlusLow;		//MOTOR_Plus输出关闭（低电平）
				TIM_Cmd(MOTOR_TIMxUD, DISABLE); 	//关闭定时器
			}
			else	if(SteepCount>=SteepNeedToRun)	//运行步数到达
			{
				StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
				RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				
				MOTOR_PlusLow;		//MOTOR_Plus输出关闭（低电平）
				TIM_Cmd(MOTOR_TIMxUD, DISABLE); 	//关闭定时器
			}
			else
			{
				if(StatusOfWindow	==	0)
				{
					MOTOR_PlusLow;		//MOTOR_Plus输出低电平
				}
				else
				{
					if(SteepCount<PWM_RunUpCountUD)
					{
						RunFrequency	+=	PWM_UpdataCountUD;		//当前运行频率
						TIM_SetFreq(MOTOR_TIMxUD,RunFrequency);		//设定频率
					}
					else if(SteepCount+PWM_RunUpCountUD>=SteepNeedToRun)
					{
						RunFrequency	-=	PWM_UpdataCountUD;		//当前运行频率
						TIM_SetFreq(MOTOR_TIMxUD,RunFrequency);		//设定频率
					}
					MOTOR_PlusLow;		//MOTOR_Plus输出低电平
				}
			}
		}
		else
		{
			PlusFlg	=	1;				//步进电机脉冲标志，一个上升沿计一个脉冲
			MOTOR_PlusHigh;		//MOTOR_Plus输出高电平
		}
		TIM_ClearITPendingBit(MOTOR_TIMxUD, TIM_IT_Update);			//清除中断标志
	}
	
	
	
	if(StatusOfWindow==0	&&	RunToWindow==0)				//电机上电初始化
	{
		MOTOR_RunDown;						//
		PlusFlg						=	0;		//步进电机脉冲标志，一个上升沿计一个脉冲	
		CMDOfWindow				=	1;		//运行到指定窗口命令
		RunToWindow				=	1;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
		
		SteepCount				=	0;		//运行步数计数
		SteepNeedToRun		=	MaxWindowUD*SteepPerWindowUD+PWM_RunUpCountUD;				//需要运行的总步数
		RunFrequency			=	MOTOR_PWM_FrequencyUD;
		TIM_SetFreq(MOTOR_TIMxUD,RunFrequency);		//设定频率MOTOR_PWM_Frequency
		TIM_Cmd(MOTOR_TIMxUD, ENABLE); 						//开启定时器
	}
	else if(StatusOfWindow!=0	&&	RunToWindow==0	&&	CMDOfWindow!=0)		//电机在待机待机状态下有新的窗口命令
	{
		if(CMDOfWindow	==	StatusOfWindow)
		{			
			RunToWindow				=	0;							//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;							//运行到指定窗口命令
			
			TIM_Cmd(MOTOR_TIMxUD, DISABLE); 			//关闭定时器
		}
		else if(CMDOfWindow	>	StatusOfWindow)
		{
			MOTOR_RunUp;											//顺时针
			PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
			RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;		//运行到指定窗口命令			
			
			SteepCount				=	0;							//运行步数计数
			if(RunToWindow	==	1)
			{
				SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindowUD+PWM_RunUpCountUD;				//需要运行的总步数
			}
			else
			{
				SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindowUD;				//需要运行的总步数
			}
			
			RunFrequency			=	MOTOR_PWM_FrequencyUD;		//起始频率
			
			TIM_SetFreq(MOTOR_TIMxUD,RunFrequency);		//设定频率
			
