wegam/STM32F1xWorkSpace/Examples/HC/PC006V21 - 20180130.C
			TIM_Cmd(MOTOR_TIMxUD, ENABLE); 				//开启定时器
		}
		else if(CMDOfWindow	<	StatusOfWindow)
		{
			MOTOR_RunDown;											//逆时针
			PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
			RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;							//运行到指定窗口命令			
			
			SteepCount				=	0;							//运行步数计数
			SteepNeedToRun		=	(StatusOfWindow-RunToWindow)*SteepPerWindowUD;				//需要运行的总步数	
			
			RunFrequency			=	MOTOR_PWM_FrequencyUD;		//起始频率
			
			TIM_SetFreq(MOTOR_TIMxUD,RunFrequency);		//设定频率
			
			TIM_Cmd(MOTOR_TIMxUD, ENABLE); 				//开启定时器			
		}
	}
			
	MotorTime++;
	if(MotorTime>=1000)
	{
		
		MotorTime=0;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	0-无定时器中断，1-有定时器中断
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
u8 MotorRL_Server(void)				//查询步进电机状态
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 StatusOfWindow	=	0;	//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	
	//==============电机控制说明
	//运行过程分：启动加速，匀速运行，减速停止
	//窗口位置：
	//电机原点为中间传感器：上电时，先逆时针慢速运转到极限位再回到原点（如果在回极限位过程中找到原点，则停止在原点，初始化完成）
	
//	u8 status	=	0;
	
	if(StepMotorServer(&SteepMotor1))
	{
		if((RxMessage.StdId==SensorRL_ID)&&(RxMessage.Data[1]!=0)&&(RunToWindow==1))
		{
			StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
			RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			
			StepMotorStop(&SteepMotor1);
		}
		else if(SteepMotor1.GetPulsTotal>=SteepNeedToRun)
		{
			StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
			RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			
			StepMotorStop(&SteepMotor1);
		}
		return 1;
	}
	else
	{
		if(StatusOfWindow==0	&&	RunToWindow==0)				//电机上电初始化
		{
			MOTOR_RunLeft;						//逆时针
			PlusFlg						=	0;		//步进电机脉冲标志，一个上升沿计一个脉冲	
			CMDOfWindow				=	1;		//运行到指定窗口命令
			RunToWindow				=	1;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			
			SteepCount				=	0;		//运行步数计数
			SteepNeedToRun		=	MaxWindowRL*SteepPerWindowRL+PWM_RunUpCountRL;				//需要运行的总步数
	//		RunFrequency			=	2*MOTOR_PWM_FrequencyRL;
	//		TIM_SetFreq(MOTOR_TIMxRL,RunFrequency);		//设定频率MOTOR_PWM_Frequency
//			TIM_Cmd(MOTOR_TIMxRL, ENABLE); 						//开启定时器
			
			StepMotorCW(&SteepMotor1,MOTOR_PWM_FrequencyRL,0,0,0,0,SteepNeedToRun);		//顺时针旋转
		}
		else if(StatusOfWindow!=0	&&	RunToWindow==0	&&	CMDOfWindow!=0)		//电机在待机待机状态下有新的窗口命令
		{
			if(CMDOfWindow	==	StatusOfWindow)
			{			
				RunToWindow				=	0;							//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				CMDOfWindow				=	0;							//运行到指定窗口命令
				
				StepMotorStop(&SteepMotor1);
			}
			else if(CMDOfWindow	>	StatusOfWindow)
			{

				PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
				RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				CMDOfWindow				=	0;		//运行到指定窗口命令			
				
				SteepCount				=	0;							//运行步数计数
				if(RunToWindow	==	1)
				{
					SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindowRL+PWM_RunUpCountRL/5;				//需要运行的总步数
				}
				else
				{
					SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindowRL;				//需要运行的总步数
				}
				
				RunFrequency			=	MOTOR_PWM_FrequencyRL;		//起始频率
				
				StepMotorCCW(&SteepMotor1,MOTOR_PWM_FrequencyRL,PWM_UpdataCountRL,PWM_RunUpCountRL,PWM_UpdataCountRL,PWM_RunUpCountRL,SteepNeedToRun);		//顺时针旋转
			}
			else if(CMDOfWindow	<	StatusOfWindow)
			{

				PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
				RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				CMDOfWindow				=	0;							//运行到指定窗口命令			
				
				SteepCount				=	0;							//运行步数计数
				SteepNeedToRun		=	(StatusOfWindow-RunToWindow)*SteepPerWindowRL;				//需要运行的总步数	
				
				RunFrequency			=	MOTOR_PWM_FrequencyRL;		//起始频率
				
				StepMotorCW(&SteepMotor1,MOTOR_PWM_FrequencyRL,PWM_UpdataCountRL,PWM_RunUpCountRL,PWM_UpdataCountRL,PWM_RunUpCountRL,SteepNeedToRun);		//顺时针旋转		
			}
		}
				
		MotorTime++;
		if(MotorTime>=1000)
		{
			
			MotorTime=0;
		}
		return 0;
	}
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	0-无定时器中断，1-有定时器中断
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
u8 MotorRL_Serverbac(void)				//查询步进电机状态
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 StatusOfWindow	=	0;	//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	
	//==============电机控制说明
	//运行过程分：启动加速，匀速运行，减速停止
	//窗口位置：
	//电机原点为中间传感器：上电时，先逆时针慢速运转到极限位再回到原点（如果在回极限位过程中找到原点，则停止在原点，初始化完成）
	
//	u8 status	=	0;
	
	
	if((MOTOR_TIMxRL->SR & TIM_IT_Update)==TIM_IT_Update	&&	RunToWindow!=0)			//表示定时中断---运行计数未完
	{
		if(PlusFlg	!=0)			//步进电机脉冲标志，一个上升沿计一个脉冲
		{
			PlusFlg	=	0;				//步进电机脉冲标志，一个上升沿计一个脉冲
			SteepCount	+=	1;							//运行步数计数
			if((RxMessage.StdId==SensorRL_ID)&&(RxMessage.Data[1]!=0)&&(RunToWindow==1))
			{
				StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
				RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				
				MOTOR_PlusLow;		//MOTOR_Plus输出关闭（低电平）
				TIM_Cmd(MOTOR_TIMxRL, DISABLE); 	//关闭定时器
			}
			else if(SteepCount>=SteepNeedToRun)	//运行步数到达
			{
				StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
				RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				
				MOTOR_PlusLow;		//MOTOR_Plus输出关闭（低电平）
				TIM_Cmd(MOTOR_TIMxRL, DISABLE); 	//关闭定时器
			}
			else
			{
				if(StatusOfWindow	==	0)
				{
					MOTOR_PlusLow;		//MOTOR_Plus输出低电平
				}
				else
				{
					if(SteepCount<PWM_RunUpCountRL)
					{
						RunFrequency	+=	PWM_UpdataCountRL;		//当前运行频率
						TIM_SetFreq(MOTOR_TIMxRL,RunFrequency);		//设定频率
					}
					else if(SteepCount+PWM_RunUpCountRL>=SteepNeedToRun)
					{
						RunFrequency	-=	PWM_UpdataCountRL;		//当前运行频率
						TIM_SetFreq(MOTOR_TIMxRL,RunFrequency);		//设定频率
					}
					MOTOR_PlusLow;		//MOTOR_Plus输出低电平
				}
			}
		}
		else
		{
			PlusFlg	=	1;				//步进电机脉冲标志，一个上升沿计一个脉冲
			MOTOR_PlusHigh;		//MOTOR_Plus输出高电平
		}
		TIM_ClearITPendingBit(MOTOR_TIMxRL, TIM_IT_Update);			//清除中断标志
	}
	
	
	
