wegam/STM32F1xWorkSpace/Examples/HC/PC006V21 - 20180130.C
	if(StatusOfWindow==0	&&	RunToWindow==0)				//电机上电初始化
	{
		MOTOR_RunLeft;						//逆时针
		PlusFlg						=	0;		//步进电机脉冲标志，一个上升沿计一个脉冲	
		CMDOfWindow				=	1;		//运行到指定窗口命令
		RunToWindow				=	1;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
		
		SteepCount				=	0;		//运行步数计数
		SteepNeedToRun		=	MaxWindowRL*SteepPerWindowRL+PWM_RunUpCountRL;				//需要运行的总步数
		RunFrequency			=	2*MOTOR_PWM_FrequencyRL;
		TIM_SetFreq(MOTOR_TIMxRL,RunFrequency);		//设定频率MOTOR_PWM_Frequency
		TIM_Cmd(MOTOR_TIMxRL, ENABLE); 						//开启定时器
	}
	else if(StatusOfWindow!=0	&&	RunToWindow==0	&&	CMDOfWindow!=0)		//电机在待机待机状态下有新的窗口命令
	{
		if(CMDOfWindow	==	StatusOfWindow)
		{			
			RunToWindow				=	0;							//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;							//运行到指定窗口命令
			
			TIM_Cmd(MOTOR_TIMxRL, DISABLE); 			//关闭定时器
		}
		else if(CMDOfWindow	>	StatusOfWindow)
		{
			MOTOR_RunRight;											//顺时针
			PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
			RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;		//运行到指定窗口命令			
			
			SteepCount				=	0;							//运行步数计数
			if(RunToWindow	==	1)
			{
				SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindowRL+PWM_RunUpCountRL;				//需要运行的总步数
			}
			else
			{
				SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindowRL;				//需要运行的总步数
			}
			
			RunFrequency			=	MOTOR_PWM_FrequencyRL;		//起始频率
			
			TIM_SetFreq(MOTOR_TIMxRL,RunFrequency);				//设定频率
			
			TIM_Cmd(MOTOR_TIMxRL, ENABLE); 								//开启定时器
		}
		else if(CMDOfWindow	<	StatusOfWindow)
		{
			MOTOR_RunLeft;											//逆时针
			PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
			RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;							//运行到指定窗口命令			
			
			SteepCount				=	0;							//运行步数计数
			SteepNeedToRun		=	(StatusOfWindow-RunToWindow)*SteepPerWindowRL;				//需要运行的总步数	
			
			RunFrequency			=	MOTOR_PWM_FrequencyRL;		//起始频率
			
			TIM_SetFreq(MOTOR_TIMxRL,RunFrequency);		//设定频率
			
			TIM_Cmd(MOTOR_TIMxRL, ENABLE); 				//开启定时器			
		}
	}
			
	MotorTime++;
	if(MotorTime>=1000)
	{
		
		MotorTime=0;
	}
	return 0;
}
///*******************************************************************************
//*函数名			:	function
//*功能描述		:	函数功能说明
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	
//*******************************************************************************/
//u8 SetToWindows(u8* nWindows)		//运行到指定窗口
//{
//	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
//	//	u8 StatusOfWindow	=	0;	//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
//	//	u8 CMDOfWindow	=	0;		//运行到指定窗口命令
//	//	#define	Steeps		4000	//一个窗口用到的驱动脉冲数
//	//	#define	MaxWindow	8							//最大窗口数
//	
//	u8 newWindows	=	*nWindows;
//	if(RunToWindow	!=0)				//正在运行
//	{
//		return 0;
//	}
//	if(StatusOfWindow	==	0)					//未初始化---需要找原点
//	{
//		RunToWindow	=	1;											//需要运行到的窗口数
//		
//		Motor_RunSet(0-(MaxWindow*SteepPerWindow));			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//		
//		PWM_OUT_SetFre(&PWM_Tim,MOTOR_PWM_Frequency);
//		MOTOR_RunRight;													//顺时钟
//		PWM_OUT_SetCount(&PWM_Tim,MaxWindow*SteepPerWindow);		//设置总输出脉冲个数

//		return 0;
//	}
//	if(newWindows	==0	&&	StatusOfWindow!=0)									//无效指令
//	{
//		Motor_RunSet(0);								//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//		return 0;
//	}	
//	if(newWindows	>	MaxWindow)					//超出最大窗口数里
//	{
//		*nWindows	=	0;			//将指令清除
//		return 0;	
//	}
//	if(newWindows	==	StatusOfWindow)		//当前窗口---不需要旋转
//	{
//		*nWindows	=	0;			//将指令清除
//		return 0;
//	}
//	
//	if(newWindows	>	StatusOfWindow)	//顺时针转动
//	{
//		RunToWindow	=	newWindows;		//需要运行到的窗口数
////		newWindows	=	newWindows-StatusOfWindow;
//		Motor_RunSet(((newWindows-StatusOfWindow)*SteepPerWindow));			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
////		Motor_RunSet(0-((StatusOfWindow-newWindows)*Steeps));				//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//	}
//	else		//逆转
//	{
//		RunToWindow	=	newWindows;
//		Motor_RunSet(0-((StatusOfWindow-newWindows)*SteepPerWindow));				//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
////		Motor_RunSet(((newWindows-StatusOfWindow)*Steeps));			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//	}
//	*nWindows	=	0;			//将指令清除
//	return 1;
//}



/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void CAN_Server(void)			//CAN收发数据管理
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板
	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	u8 status	=	0;		//CAN读取返回0表示无效
	
	if(SensorRL)															//传感器板---旋转电机开始运行时开始采集信号
	{
		status	=	CAN_RX_DATA(&RxMessage);									//检查CAN接收有无数据
		if(status)		//未接收到数据
		{
			SYSTime	=	0;
			if(RxMessage.StdId	==	MotorRL_ID)							//旋转电机控制板发来数据
			{
				//传感器信号采集开关
				if(RxMessage.Data[0]==0xAF	&&	RxMessage.Data[1]==0x01)
				{				
					SensorON	=	1;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
				}
				else if(RxMessage.Data[0]==0xAF	&&	RxMessage.Data[1]==0x00)
				{				
					SensorON	=	0;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
				}
				memset(RxMessage.Data,0x00,2);
			}
		}
		else if(SensorON)
		{
//			if(SYSTime%5==0)									//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
//			{
				CAN_StdTX_DATA(SensorRL_ID,4,Sensor);			//CAN使用标准帧发送数据---发送传感器数据 0.5ms发送间隔
//			}
		}
		
	}
	else if(MotorRL)				//旋转电机控制板
	{
		//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
		status	=	CAN_RX_DATA(&RxMessage);									//检查CAN接收有无数据
		if(status	!=	0)		//接收到数据
		{
			if(RxMessage.StdId	==	Cmd_ID)							//旋转电机控制板接收到控制命令
			{
				if(RxMessage.Data[0]==0xFA	&&	RxMessage.Data[1]==0x55)	//运行到指定窗口命令
				{
					CMDOfWindow	=	RxMessage.Data[2];
				}	
			}
		}
		
		if(RunToWindow!=0	&&	SensorON!=1)			//电机在运转---需要传感器板返回传感器信号
		{
			Sensor[0]	=	0xAF;
			Sensor[1]	=	0x01;
			SensorON	=	1;
			CAN_StdTX_DATA(MotorRL_ID,2,Sensor);				//CAN使用标准帧发送数据
			memset(Sensor,0x00,2);
		}
		else if(RunToWindow==0	&&	SensorON!=0)				//电机停止运转---传感器板停止采集信号
		{
			Sensor[0]	=	0xAF;
			Sensor[1]	=	0x00;
			SensorON	=	0;
			CAN_StdTX_DATA(MotorRL_ID,2,Sensor);				//CAN使用标准帧发送数据
			memset(Sensor,0x00,2);
		}
	}
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Switch_Server(void)			//检查拔码地址有无变更，如果变更，重新配置运行参数
{
	
	SWITCHID_Read(&SWITCHID);		//
	
	if((SWITCHID.nSWITCHID&0x3F)	!=	SwitchData)
	{
		Reset_Data();		//复位所有的全局变量值
		SwitchData	=	SWITCHID.nSWITCHID&0x3F;
		PC006V21_Configuration();
	}
	else if((SWITCHID.nSWITCHID&0x3F)	==	0x00)		//拨码未拨，循环配置
	{
		PC006V21_Configuration();
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Reset_Data(void)		//复位所有的全局变量值
{
	SwitchData	=	0;	//存储拔码开关最新地址，如果地址变化，再重新配置运行参数
	SensorRL		=	0;	//传感器板标志，0-非旋转传感器板，1-旋转传感器板
	MotorRL		=	0;	//旋转电机控制板标志，0-非旋转电机控制板，1-旋转电机控制板
	MotorUD		=	0;	//升降电机控制板标志，0-非升降电机控制，1-升降电机控制
	MotorTime	=	0;	//旋转电机测试运行时间

	SYSTime=0;

	memset(Sensor,0x00,4);	//4个传感器感应值存储区
	SensorON		=	0	;				//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报/电机控制板来储存是否开启传感器标志

	RunToWindow	=	0;				//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	StatusOfWindow	=	0;		//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	CMDOfWindow	=	0;				//运行到指定窗口命令
}



#endif
